comp6250/cep/reflective/reflective.org
#+TITLE: Resources on Reflective Writing
#+AUTHOR: errenil <errelinaaron@gmail.com>

* MelbourneU                                                      :diep:
URL: https://students.unimelb.edu.au/academic-skills/resources/developing-an-academic-writing-style/reflective-writing


* UNSW
- Guide: https://www.student.unsw.edu.au/reflective-writing
- Examples: https://www.student.unsw.edu.au/examples-reflective-writing

** Reflective writing /is/:
- documenting your response to experiences, opinions, events or new information
communicating your response to thoughts and feelings
- a way of exploring your learning
- an opportunity to gain self-knowledge
- a way to achieve clarity and better understanding of what you are learning
- a chance to develop and reinforce writing skills
- a way of making meaning out of what you study

** Reflective writing /is not/:
- just conveying information, instruction or argument
- pure description, though there may be descriptive elements
- straightforward decision or judgement, e.g. about whether something is right or wrong, good or bad
- simple problem-solving
- a summary of course notes
- a standard university essay.



* UOW                                                             :frameworks:
https://www.uow.edu.au/student/learning-co-op/assessments/reflective-writing/

** Reflective frameworks
1. *Rolfe’s minimal model*: a basic starting point to get you thinking reflectively
    - URL:   http://my.cumbria.ac.uk/Public/LISS/Documents/skillsatcumbria/ReflectiveModelRolfe.pdf



2. *[[*MelbourneU][DIEP]]*: a useful guide to write a critical or academic reflection, such as an essay, by putting each topic into four paragraphs
   - URL https://emedia.rmit.edu.au/learninglab/content/reflective-writing-1

3. *Kolb’s reflective cycle*: a useful guide for practical experiences, such as internships or placements
    - URL: https://www.youtube.com/watch?v=ObQ2DheGOKA

4. *Gibb’s reflective cycle*: a useful guide for learning journals and practical experiences, such as group work
   - TEXT: https://www.ed.ac.uk/reflection/reflectors-toolkit/reflecting-on-experience/gibbs-reflective-cycle
   - VIDEO: https://www.youtube.com/watch?v=5WfnHGq6ztg

5. *The 5Rs framework*: a useful framework for reflecting on coursework or practical experiences, such as projects
   - URL:  http://www.studenteportfolio.qut.edu.au/staff_resources/resources/The%205%20Rs_Framework.pdf


* Hull                                                           :frameworks:
** Reflective frameworks:
https://libguides.hull.ac.uk/reflectivewriting/reflection3


* JCU                                                          :vocab:struct:
URL: https://www.jcu.edu.au/__data/assets/pdf_file/0004/120478/jcu_128366.pdf


* Edingburgh                                                           :Gibb:
** Gibb's Reflective Cycle
https://www.ed.ac.uk/reflection/reflectors-toolkit/reflecting-on-experience/gibbs-reflective-cycle


* Monash                                                               :Gibb:
** Gibb's Reflective Cycle
https://www.monash.edu/student-academic-success/excel-at-writing/annotated-assessment-samples/information-technology/it-reflective-writing


* UTS                                                                  :Gibb:
Gibb's and 3R
https://www.uts.edu.au/current-students/support/helps/self-help-resources/types-assignments/reflective-tasks


* ANU                                                         :business:Gibb:
** Reflective writing
URL: https://www.anu.edu.au/students/academic-skills/writing-assessment/reflective-writing

** Reflective essay examples (business)
URL: https://www.anu.edu.au/students/academic-skills/writing-assessment/reflective-writing/reflective-essays#:~:text=Reflective%20essays%20are%20academic%20essays,to%20back%20up%20your%20reflections.

** Rubric for career episode piece
URL: https://wattlecourses.anu.edu.au/pluginfile.php/3440399/mod_resource/content/9/Marking%20Rubric%20%20Career%20Episode%20Piece.pdf



* Western Sydney
https://www.westernsydney.edu.au/__data/assets/pdf_file/0007/1082779/Reflective_writing_Structure.pdf


* University of Sydney
[[https://www.sydney.edu.au/content/dam/students/documents/learning-resources/learning-centre/writing/reflective-writing.pdf][reflective writing guide.pdf]]



* Learning Hub
https://www.learninghub.ac.nz/writing/reflective-writing/
