comp6250/cep/reflective/reflective.tex
% Created 2023-09-03 Sun 11:00
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{errenil <errelinaaron@gmail.com>}
\date{\today}
\title{Resources on Reflective Writing}
\hypersetup{
 pdfauthor={errenil <errelinaaron@gmail.com>},
 pdftitle={Resources on Reflective Writing},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.6.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{MelbourneU\hfill{}\textsc{diep}}
\label{sec:orga1dc854}
URL: \url{https://students.unimelb.edu.au/academic-skills/resources/developing-an-academic-writing-style/reflective-writing}


\section{UNSW}
\label{sec:orgd4ccebd}
\begin{itemize}
\item Guide: \url{https://www.student.unsw.edu.au/reflective-writing}
\item Examples: \url{https://www.student.unsw.edu.au/examples-reflective-writing}
\end{itemize}

\subsection{Reflective writing \emph{is}:}
\label{sec:orgabf3c65}
\begin{itemize}
\item documenting your response to experiences, opinions, events or new information
\end{itemize}
communicating your response to thoughts and feelings
\begin{itemize}
\item a way of exploring your learning
\item an opportunity to gain self-knowledge
\item a way to achieve clarity and better understanding of what you are learning
\item a chance to develop and reinforce writing skills
\item a way of making meaning out of what you study
\end{itemize}

\subsection{Reflective writing \emph{is not}:}
\label{sec:orgef00152}
\begin{itemize}
\item just conveying information, instruction or argument
\item pure description, though there may be descriptive elements
\item straightforward decision or judgement, e.g. about whether something is right or wrong, good or bad
\item simple problem-solving
\item a summary of course notes
\item a standard university essay.
\end{itemize}



\section{UOW\hfill{}\textsc{frameworks}}
\label{sec:orgdeee4fb}
\url{https://www.uow.edu.au/student/learning-co-op/assessments/reflective-writing/}

\subsection{Reflective frameworks}
\label{sec:org19517f4}
\begin{enumerate}
\item \textbf{Rolfe’s minimal model}: a basic starting point to get you thinking reflectively
\begin{itemize}
\item URL:   \url{http://my.cumbria.ac.uk/Public/LISS/Documents/skillsatcumbria/ReflectiveModelRolfe.pdf}
\end{itemize}
\end{enumerate}



\begin{enumerate}
\item \textbf{\hyperref[sec:orga1dc854]{DIEP}}: a useful guide to write a critical or academic reflection, such as an essay, by putting each topic into four paragraphs
\begin{itemize}
\item URL \url{https://emedia.rmit.edu.au/learninglab/content/reflective-writing-1}
\end{itemize}

\item \textbf{Kolb’s reflective cycle}: a useful guide for practical experiences, such as internships or placements
\begin{itemize}
\item URL: \url{https://www.youtube.com/watch?v=ObQ2DheGOKA}
\end{itemize}

\item \textbf{Gibb’s reflective cycle}: a useful guide for learning journals and practical experiences, such as group work
\begin{itemize}
\item TEXT: \url{https://www.ed.ac.uk/reflection/reflectors-toolkit/reflecting-on-experience/gibbs-reflective-cycle}
\item VIDEO: \url{https://www.youtube.com/watch?v=5WfnHGq6ztg}
\end{itemize}

\item \textbf{The 5Rs framework}: a useful framework for reflecting on coursework or practical experiences, such as projects
\begin{itemize}
\item URL:  \url{http://www.studenteportfolio.qut.edu.au/staff\_resources/resources/The\%205\%20Rs\_Framework.pdf}
\end{itemize}
\end{enumerate}


\section{Hull\hfill{}\textsc{frameworks}}
\label{sec:orgfb8c074}
\subsection{Reflective frameworks:}
\label{sec:orgf7effd9}
\url{https://libguides.hull.ac.uk/reflectivewriting/reflection3}



\section{Edingburgh\hfill{}\textsc{Gibb}}
\label{sec:org9ebcb57}
\subsection{Gibb's Reflective Cycle}
\label{sec:org13cd55d}
\url{https://www.ed.ac.uk/reflection/reflectors-toolkit/reflecting-on-experience/gibbs-reflective-cycle}


\section{Monash\hfill{}\textsc{Gibb}}
\label{sec:org22a4053}
\subsection{Gibb's Reflective Cycle}
\label{sec:org46e61d9}
\url{https://www.monash.edu/student-academic-success/excel-at-writing/annotated-assessment-samples/information-technology/it-reflective-writing}


\section{UTS\hfill{}\textsc{Gibb}}
\label{sec:orgc4019fb}
Gibb's and 3R
\url{https://www.uts.edu.au/current-students/support/helps/self-help-resources/types-assignments/reflective-tasks}


\section{ANU\hfill{}\textsc{business:Gibb}}
\label{sec:org6f2399c}
\url{https://www.anu.edu.au/students/academic-skills/writing-assessment/reflective-writing/reflective-essays\#:\~:text=Reflective\%20essays\%20are\%20academic\%20essays,to\%20back\%20up\%20your\%20reflections}.


\section{Western Sydney}
\label{sec:orgf7b243e}
\url{https://www.westernsydney.edu.au/\_\_data/assets/pdf\_file/0007/1082779/Reflective\_writing\_Structure.pdf}


\section{University of Sydney}
\label{sec:org75f0ee5}
\href{https://www.sydney.edu.au/content/dam/students/documents/learning-resources/learning-centre/writing/reflective-writing.pdf}{reflective writing guide.pdf}



\section{Learning Hub}
\label{sec:org38f51ac}
\url{https://www.learninghub.ac.nz/writing/reflective-writing/}
\end{document}